app/Controllers/Almacenes.php

SELECT *
FROM `almacenes`
---
    public function index()
    {
        $model = new AlmacenModel();
        $data = [
            'title'     => 'Almacenes',
            'almacenes' => $model->findAll(),