app/Controllers/Categorias.php

    public function index()
    {
        $model = new CategoriaModel();
        $data = [
            'title'      => 'Categorías',
            'categorias' => $model->findAll(),
---
SELECT *
FROM `categorias`