app/Controllers/Dashboard.php

    public function index()
    {
        $productoModel = new ProductoModel();
        $stockModel    = new StockModel();
        $movModel      = new MovimientoStockModel();

        $data = [
            'title'          => 'Dashboard',
            'total_productos' => $productoModel->where('activo', 1)->countAllResults(),
            'total_categorias' => $productoModel->db->table('categorias')->countAllResults(),
            'total_proveedores' => $productoModel->db->table('proveedores')->where('activo', 1)->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `activo` = 1
SELECT COUNT(*) AS `numrows`
FROM `categorias`
SELECT COUNT(*) AS `numrows`
FROM `proveedores`
WHERE `activo` = 1