app/Controllers/Marcas.php

    public function index()
    {
        $model = new MarcaModel();
        $data = [
            'title'  => 'Marcas',
            'marcas' => $model->findAll(),
---
SELECT *
FROM `marcas`