app/Controllers/Proveedores.php

    public function index()
    {
        $model = new ProveedorModel();
        $data = [
            'title'       => 'Proveedores',
            'proveedores' => $model->findAll(),
---
SELECT *
FROM `proveedores`