app/Controllers/Stock.php

    public function movimiento(int $productoId = null)
    {
        $productoModel = new ProductoModel();

        if ($productoId) {
            $producto = $productoModel->getProductoDetalle($productoId);
            if (!$producto) {
                return redirect()->to(base_url('stock'))->with('error', 'Producto no encontrado.');
            }
        }

        $data = [
            'title'    => $productoId ? 'Registrar Movimiento' : 'Registrar Movimiento',
            'productos' => $productoModel->where('activo', 1)->findAll(),
---
SELECT *
FROM `productos`
WHERE `activo` = 1