app/Models/MovimientoStockModel.php

SELECT `movimientos_stock`.*, `productos`.`nombre` as `producto_nombre`, `productos`.`codigo` as `producto_codigo`, `usuarios`.`nombre_completo` as `usuario_nombre`
FROM `movimientos_stock`
LEFT JOIN `productos` ON `productos`.`id` = `movimientos_stock`.`producto_id`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `movimientos_stock`.`usuario_id`
ORDER BY `movimientos_stock`.`fecha_movimiento` DESC
---
    public function getMovimientosConDetalles(int $productoId = null)
    {
        $builder = $this->select('movimientos_stock.*, productos.nombre as producto_nombre,
                                 productos.codigo as producto_codigo,
                                 usuarios.nombre_completo as usuario_nombre')
            ->join('productos', 'productos.id = movimientos_stock.producto_id', 'left')
            ->join('usuarios', 'usuarios.id = movimientos_stock.usuario_id', 'left')
            ->orderBy('movimientos_stock.fecha_movimiento', 'DESC');

        if ($productoId) {
            $builder->where('movimientos_stock.producto_id', $productoId);
        }

        return $builder->findAll();