app/Models/ProductoModel.php

SELECT `productos`.*, `categorias`.`nombre` as `categoria_nombre`, `marcas`.`nombre` as `marca_nombre`, `proveedores`.`nombre` as `proveedor_nombre`, COALESCE(stocks.cantidad, 0) as stock_actual
FROM `productos`
LEFT JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
LEFT JOIN `marcas` ON `marcas`.`id` = `productos`.`marca_id`
LEFT JOIN `proveedores` ON `proveedores`.`id` = `productos`.`proveedor_id`
LEFT JOIN `stocks` ON `stocks`.`producto_id` = `productos`.`id`
WHERE `productos`.`activo` = 1
---
    public function getProductosConDetalles()
    {
        return $this->select('productos.*, categorias.nombre as categoria_nombre,
                             marcas.nombre as marca_nombre, proveedores.nombre as proveedor_nombre,
                             COALESCE(stocks.cantidad, 0) as stock_actual')
            ->join('categorias', 'categorias.id = productos.categoria_id', 'left')
            ->join('marcas', 'marcas.id = productos.marca_id', 'left')
            ->join('proveedores', 'proveedores.id = productos.proveedor_id', 'left')
            ->join('stocks', 'stocks.producto_id = productos.id', 'left')
            ->where('productos.activo', 1)
            ->findAll();