app/Models/StockModel.php

SELECT *
FROM `stocks`
WHERE `producto_id` = 1
 LIMIT 1
---
    public function getCantidad(int $productoId): int
    {
        $stock = $this->where('producto_id', $productoId)->first();

SELECT *
FROM `stocks`
WHERE `producto_id` = 1
 LIMIT 1
UPDATE `stocks` SET `cantidad` = 45, `updated_at` = '2026-04-13 06:49:10'
WHERE `stocks`.`id` IN ('1')
---
    public function ajustarStock(int $productoId, int $cantidad): bool
    {
        $stock = $this->where('producto_id', $productoId)->first();

        if ($stock) {
            return $this->update($stock['id'], ['cantidad' => $cantidad]);

SELECT `p`.`id`, `p`.`codigo`, `p`.`nombre`, `c`.`nombre` as `categoria_nombre`, `s`.`cantidad` as `stock_actual`, `p`.`stock_minimo`, (p.stock_minimo - s.cantidad) as cantidad_faltante
FROM `productos` `p`
LEFT JOIN `stocks` `s` ON `s`.`producto_id` = `p`.`id`
LEFT JOIN `categorias` `c` ON `c`.`id` = `p`.`categoria_id`
WHERE `p`.`activo` = 1
AND `s`.`cantidad` <= `p`.`stock_minimo`
---
    public function getStockBajo()
    {
        return $this->db->table('productos p')
            ->select('p.id, p.codigo, p.nombre, c.nombre as categoria_nombre,
                      s.cantidad as stock_actual, p.stock_minimo,
                      (p.stock_minimo - s.cantidad) as cantidad_faltante')
            ->join('stocks s', 's.producto_id = p.id', 'left')
            ->join('categorias c', 'c.id = p.categoria_id', 'left')
            ->where('p.activo', 1)
            ->where('s.cantidad <= p.stock_minimo')
            ->get()
            ->getResultArray();