app/Models/UserModel.php

SELECT `usuarios`.*, `roles`.`nombre` as `role_nombre`
FROM `usuarios`
JOIN `roles` ON `roles`.`id` = `usuarios`.`role_id`
---
    public function getUsersWithRole()
    {
        return $this->select('usuarios.*, roles.nombre as role_nombre')
            ->join('roles', 'roles.id = usuarios.role_id')
            ->findAll();